; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-8-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-1 - location
	p0-8 - location
	p0-10 - location
	p1-2 - location
	p1-8 - location
	p2-0 - location
	p3-5 - location
	p6-0 - location
	p6-3 - location
	p6-10 - location
	p7-0 - location
	p7-4 - location
	p8-7 - location
	p9-6 - location
	p10-2 - location
	p10-4 - location
	p10-8 - location
	p10-9 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s9)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s6)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s7)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s4)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s1)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s10)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s7)
	(at package2 s1)
	(at package3 s0)
	(at package4 s1)
	(at package5 s3)
	(at package6 s8)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s0 p0-10)
	(path p0-10 s0)
	(path s10 p0-10)
	(path p0-10 s10)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-10)
	(path p6-10 s6)
	(path s10 p6-10)
	(path p6-10 s10)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(path s10 p10-2)
	(path p10-2 s10)
	(path s2 p10-2)
	(path p10-2 s2)
	(path s10 p10-4)
	(path p10-4 s10)
	(path s4 p10-4)
	(path p10-4 s4)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 9)
	(= (time-to-drive s8 s0) 9)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 62)
	(= (time-to-drive s9 s0) 62)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 40)
	(= (time-to-drive s3 s1) 40)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 84)
	(= (time-to-drive s4 s1) 84)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 68)
	(= (time-to-drive s8 s1) 68)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 9)
	(= (time-to-drive s9 s1) 9)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 72)
	(= (time-to-drive s10 s1) 72)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 83)
	(= (time-to-drive s5 s2) 83)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 49)
	(= (time-to-drive s7 s2) 49)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 93)
	(= (time-to-drive s0 s3) 93)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 36)
	(= (time-to-drive s2 s3) 36)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 8)
	(= (time-to-drive s4 s3) 8)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 69)
	(= (time-to-drive s5 s3) 69)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 2)
	(= (time-to-drive s6 s3) 2)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 73)
	(= (time-to-drive s8 s3) 73)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 3)
	(= (time-to-drive s8 s4) 3)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 49)
	(= (time-to-drive s4 s5) 49)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 49)
	(= (time-to-drive s7 s5) 49)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 45)
	(= (time-to-drive s1 s6) 45)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 78)
	(= (time-to-drive s2 s6) 78)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 60)
	(= (time-to-drive s5 s6) 60)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 82)
	(= (time-to-drive s8 s6) 82)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 29)
	(= (time-to-drive s0 s7) 29)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 45)
	(= (time-to-drive s3 s7) 45)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 73)
	(= (time-to-drive s9 s7) 73)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 60)
	(= (time-to-drive s5 s8) 60)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 63)
	(= (time-to-drive s3 s9) 63)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 84)
	(= (time-to-drive s10 s9) 84)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 96)
	(= (time-to-drive s3 s10) 96)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 30)
	(= (time-to-drive s5 s10) 30)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 54)
	(= (time-to-drive s6 s10) 54)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s10)
	(at driver2 s3)
	(at driver3 s8)
	(at truck3 s4)
	(at truck4 s6)
	(at truck6 s7)
	(at package1 s3)
	(at package2 s6)
	(at package3 s6)
	(at package4 s0)
	(at package5 s10)
	(at package6 s6)
	))

(:metric minimize (+ (* 1 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver1 truck7 s1)
   deleted: (at driver1 s1) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 1 of 12
2. (load-truck package4 truck7 s1)
   deleted: (at package4 s1)
   added: (in package4 truck7)
   changed: (load truck7) from 0 to 1, (fuel-per-minute truck7) from 10 to 11
   goals met: 1 of 12
3. (load-truck package2 truck7 s1)
   deleted: (at package2 s1)
   added: (in package2 truck7)
   changed: (load truck7) from 1 to 2, (fuel-per-minute truck7) from 11 to 13
   goals met: 1 of 12
4. (walk driver2 s2 p2-0)
   deleted: (at driver2 s2)
   added: (at driver2 p2-0)
   goals met: 1 of 12
5. (drive-truck truck7 s1 s6 driver1)
   deleted: (at truck7 s1)
   added: (at truck7 s6)
   changed: (fuel-used) from 0 to 585
   goals met: 1 of 12
6. (unload-truck package2 truck7 s6)
   deleted: (in package2 truck7)
   added: (at package2 s6)
   changed: (load truck7) from 2 to 1, (fuel-per-minute truck7) from 13 to 11
   goals met: 2 of 12
7. (drive-truck truck7 s6 s3 driver1)
   deleted: (at truck7 s6)
   added: (at truck7 s3)
   changed: (fuel-used) from 585 to 607
   goals met: 2 of 12
8. (load-truck package5 truck7 s3)
   deleted: (at package5 s3)
   added: (in package5 truck7)
   changed: (load truck7) from 1 to 2, (fuel-per-minute truck7) from 11 to 13
   goals met: 2 of 12
9. (drive-truck truck7 s3 s6 driver1)
   deleted: (at truck7 s3)
   added: (at truck7 s6)
   changed: (fuel-used) from 607 to 633
   goals met: 2 of 12
10. (walk driver2 p2-0 s2)
   deleted: (at driver2 p2-0)
   added: (at driver2 s2)
   goals met: 2 of 12
11. (drive-truck truck7 s6 s2 driver1)
   deleted: (at truck7 s6)
   added: (at truck7 s2)
   changed: (fuel-used) from 633 to 1647
   goals met: 2 of 12
12. (drive-truck truck7 s2 s7 driver1)
   deleted: (at truck7 s2)
   added: (at truck7 s7)
   changed: (fuel-used) from 1647 to 2284
   goals met: 2 of 12
13. (load-truck package1 truck7 s7)
   deleted: (at package1 s7)
   added: (in package1 truck7)
   changed: (load truck7) from 2 to 3, (fuel-per-minute truck7) from 13 to 16
   goals met: 2 of 12
14. (drive-truck truck7 s7 s9 driver1)
   deleted: (at truck7 s7)
   added: (at truck7 s9)
   changed: (fuel-used) from 2284 to 3452
   goals met: 2 of 12
15. (walk driver2 s2 p10-2)
   deleted: (at driver2 s2)
   added: (at driver2 p10-2)
   goals met: 2 of 12
16. (drive-truck truck7 s9 s0 driver1)
   deleted: (at truck7 s9)
   added: (at truck7 s0)
   changed: (fuel-used) from 3452 to 4444
   goals met: 2 of 12
17. (unload-truck package4 truck7 s0)
   deleted: (in package4 truck7)
   added: (at package4 s0)
   changed: (load truck7) from 3 to 2, (fuel-per-minute truck7) from 16 to 13
   goals met: 3 of 12
18. (drive-truck truck7 s0 s9 driver1)
   deleted: (at truck7 s0)
   added: (at truck7 s9)
   changed: (fuel-used) from 4444 to 5250
   goals met: 3 of 12
19. (walk driver3 s2 p2-0)
   deleted: (at driver3 s2)
   added: (at driver3 p2-0)
   goals met: 3 of 12
20. (walk driver2 p10-2 s10)
   deleted: (at driver2 p10-2)
   added: (at driver2 s10)
   goals met: 3 of 12
21. (walk driver2 s10 p10-4)
   deleted: (at driver2 s10)
   added: (at driver2 p10-4)
   goals met: 3 of 12
22. (walk driver2 p10-4 s4)
   deleted: (at driver2 p10-4)
   added: (at driver2 s4)
   goals met: 3 of 12
23. (drive-truck truck7 s9 s10 driver1)
   deleted: (at truck7 s9)
   added: (at truck7 s10)
   changed: (fuel-used) from 5250 to 6342
   goals met: 3 of 12
24. (unload-truck package5 truck7 s10)
   deleted: (in package5 truck7)
   added: (at package5 s10)
   changed: (load truck7) from 2 to 1, (fuel-per-minute truck7) from 13 to 11
   goals met: 4 of 12
25. (drive-truck truck7 s10 s9 driver1)
   deleted: (at truck7 s10)
   added: (at truck7 s9)
   changed: (fuel-used) from 6342 to 7266
   goals met: 4 of 12
26. (disembark-truck driver1 truck7 s9)
   deleted: (driving driver1 truck7)
   added: (at driver1 s9) (empty truck7)
   goals met: 4 of 12
27. (board-truck driver2 truck6 s4)
   deleted: (at driver2 s4) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 4 of 12
28. (drive-truck truck6 s4 s3 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s3)
   changed: (fuel-used) from 7266 to 7346
   goals met: 4 of 12
29. (unload-truck package1 truck7 s9)
   deleted: (in package1 truck7)
   added: (at package1 s9)
   changed: (load truck7) from 1 to 0, (fuel-per-minute truck7) from 11 to 10
   goals met: 4 of 12
30. (walk driver3 p2-0 s0)
   deleted: (at driver3 p2-0)
   added: (at driver3 s0)
   goals met: 4 of 12
31. (walk driver3 s0 p0-8)
   deleted: (at driver3 s0)
   added: (at driver3 p0-8)
   goals met: 4 of 12
32. (walk driver3 p0-8 s8)
   deleted: (at driver3 p0-8)
   added: (at driver3 s8)
   goals met: 5 of 12
33. (load-truck package1 truck3 s9)
   deleted: (at package1 s9)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 12
34. (board-truck driver1 truck3 s9)
   deleted: (at driver1 s9) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 5 of 12
35. (drive-truck truck3 s9 s3 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s3)
   changed: (fuel-used) from 7346 to 8039
   goals met: 5 of 12
36. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 12
37. (drive-truck truck3 s3 s8 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s8)
   changed: (fuel-used) from 8039 to 8769
   goals met: 6 of 12
38. (load-truck package6 truck3 s8)
   deleted: (at package6 s8)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 12
39. (drive-truck truck3 s8 s6 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   changed: (fuel-used) from 8769 to 9671
   goals met: 6 of 12
40. (unload-truck package6 truck3 s6)
   deleted: (in package6 truck3)
   added: (at package6 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 12
41. (drive-truck truck3 s6 s10 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s10)
   changed: (fuel-used) from 9671 to 10211
   goals met: 7 of 12
42. (drive-truck truck6 s3 s0 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   changed: (fuel-used) from 10211 to 11141
   goals met: 7 of 12
43. (load-truck package3 truck6 s0)
   deleted: (at package3 s0)
   added: (in package3 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 7 of 12
44. (drive-truck truck6 s0 s3 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (fuel-used) from 11141 to 12164
   goals met: 7 of 12
45. (disembark-truck driver2 truck6 s3)
   deleted: (driving driver2 truck6)
   added: (at driver2 s3) (empty truck6)
   goals met: 8 of 12
46. (drive-truck truck3 s10 s6 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s6)
   changed: (fuel-used) from 12164 to 12704
   goals met: 8 of 12
47. (board-truck driver2 truck6 s3)
   deleted: (at driver2 s3) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 7 of 12
48. (drive-truck truck6 s3 s6 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s6)
   changed: (fuel-used) from 12704 to 12726
   goals met: 7 of 12
49. (unload-truck package3 truck6 s6)
   deleted: (in package3 truck6)
   added: (at package3 s6)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 8 of 12
50. (drive-truck truck6 s6 s3 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s3)
   changed: (fuel-used) from 12726 to 12746
   goals met: 8 of 12
51. (drive-truck truck3 s6 s8 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   changed: (fuel-used) from 12746 to 13566
   goals met: 8 of 12
52. (drive-truck truck6 s3 s8 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s8)
   changed: (fuel-used) from 13566 to 14296
   goals met: 8 of 12
53. (drive-truck truck6 s8 s0 driver2)
   deleted: (at truck6 s8)
   added: (at truck6 s0)
   changed: (fuel-used) from 14296 to 14386
   goals met: 8 of 12
54. (disembark-truck driver2 truck6 s0)
   deleted: (driving driver2 truck6)
   added: (at driver2 s0) (empty truck6)
   goals met: 8 of 12
55. (drive-truck truck3 s8 s4 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s4)
   changed: (fuel-used) from 14386 to 14416
   goals met: 9 of 12
56. (disembark-truck driver1 truck3 s4)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 9 of 12
57. (walk driver1 s4 p10-4)
   deleted: (at driver1 s4)
   added: (at driver1 p10-4)
   goals met: 9 of 12
58. (walk driver1 p10-4 s10)
   deleted: (at driver1 p10-4)
   added: (at driver1 s10)
   goals met: 10 of 12
59. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 12
60. (drive-truck truck1 s0 s3 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 14416 to 15346
   goals met: 10 of 12
61. (walk driver3 s8 p0-8)
   deleted: (at driver3 s8)
   added: (at driver3 p0-8)
   goals met: 9 of 12
62. (walk driver3 p0-8 s0)
   deleted: (at driver3 p0-8)
   added: (at driver3 s0)
   goals met: 9 of 12
63. (board-truck driver3 truck6 s0)
   deleted: (at driver3 s0) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 9 of 12
64. (drive-truck truck6 s0 s7 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s7)
   changed: (fuel-used) from 15346 to 15636
   goals met: 10 of 12
65. (disembark-truck driver3 truck6 s7)
   deleted: (driving driver3 truck6)
   added: (at driver3 s7) (empty truck6)
   goals met: 10 of 12
66. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 11 of 12
67. (walk driver3 s7 p8-7)
   deleted: (at driver3 s7)
   added: (at driver3 p8-7)
   goals met: 11 of 12
68. (walk driver3 p8-7 s8)
   deleted: (at driver3 p8-7)
   added: (at driver3 s8)
   goals met: 12 of 12
